src/cf/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтавкаНалогообложенияПриУСН(Организация, Дата) Экспорт
    
    Если Не УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Дата) Тогда
        Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
    КонецЕсли;
    
    УстановитьПривилегированныйРежим(Истина);
    
    Запрос = Новый Запрос();
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   НастройкиУчетаНДССрезПоследних.СтавкаНалогообложенияПриУСН КАК СтавкаНалогообложенияПриУСН
    |ИЗ
    |   РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних" ;
    Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("Дата",        Дата);
    
    Результат = Запрос.Выполнить().Выгрузить();
    
    Если Результат.Количество() > 0 Тогда
        Возврат Результат[0].СтавкаНалогообложенияПриУСН;
    Иначе
        Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
    КонецЕсли;
    
КонецФункции

#КонецОбласти

#КонецЕсли
